/**
*@mainpage
*# Загальне завдання
*1. **Завдання**
*	Дано двовимірний массив з N x N цілих чисел. Помножити матрицю *саму на себе (відповідно до правил множення матриць).
*
*# Опис програми
*2. **Призачення**
*	Програма призначена для множення матриці самої на себе
*3. **Логічна структура**
*	Програма складається з двох функцій. В одній виконується *заповнення матриці випадковими числами. В іншій виконується множення *матриці саму на себе
*@author Steghniy B.
*@date 05-dec-2020
*/

/**
* @file main.c
* Програма призначена для множення матриці самої на себе
*@author Steghniy B.
*@return 0
*@version 0.1 
*@date 05-dec-2020
*/

#include <stdlib.h>
#include <time.h>

/** Розмір матриці */
#define N 3 
/** @zap Функція для заповнення масиву випадковими числами */
void zap(int mat[N][N]){
	srand (time(NULL));
	for (int i = 0; i < N; i++){
	for (int j = 0; j < N; j++){
	mat[i][j] = rand() % 10;
	}
	}
}

/** @func Функція для множення матриці самої на себе */
void func(int mat[N][N], int matmat[N][N]) {

    //Основний алгоритм знайдення добутку матриць
    for (int i = 0; i < N; i++) {
        for (int j = 0; j < N; j++) {
            for (int p = 0; p < N; p++) {
                matmat[i][j] += mat[i][p] * mat[p][j];
            }
        }
    }

}
/** Основна фунція @main */
int main()
{
    // Задаємо массив, який буде виповнювати роль матриці
    int mat[N][N];
     /** Звернення до фунції @zap */
    zap(mat);
    // Задаємо матрицю для результату
    int matmat[N][N] = {};
    /** Звернення до фунції @func */
    func(mat, matmat);

    return 0;
}
