/**
* @mainpage
*# Загальне завдання
*1. **Завдання**
*	Заповнити масив із заадної кількості елементів простими числами, *що не повторюються. Розмір вихідного масиву задати наперед перед відомим *значенням, що може будуть білшим аніж результуюча кількість отриманих *елементів.
*
*# Опис програми
*2. **Призачення**
*	Програма призначена для зaповнення масиву простими числами
*3. **Логічна структура**
*	Програма складається з двух функцій. Одна з фунцій робить *перевірку, а інша шукає прості числа на записує їх у массив
*@author Steghniy B.
*@date 05-dec-2020
*/

/** 
* @file main.c
* Програма призначена для зaповнення масиву простими числами
*@author Steghniy B.
*@return 0
*@version 0.1 
*@date 05-dec-2020
*/

/** @func1 Функція для перевірки числа */
int func1(int N) {
    // Перевірка
    if (N <= 0) {
        exit(1);
    }
    return N;
}
/** @func Функція для розрахунку простих чисел */
int func(int N, int mass[]) {
    

    

    // Цикл для знаходження простих чисел с числа N

    for (int i = 2; i <= N; i++) {
        int count = 0; // Задаємо перемінну, яка буде визначати результат
        for (int j = 2; j < i; j++) {
            if (i % j == 0) {
                count = 1;
                break;
            }
        }
        // Якщо перемінна count дорівнює нулю, то число просте 
        if (count == 0) {
            // Вводимо просте число в массив
            mass[i] = i;

        }

    }
    return 0;
}
/** Основна фунція @main */
int main()
{
/** Задаємо число, з якого будемо отримувати прості числа */
#define N 13 
    // Задаємо массив mass
    int mass[N + 1] = {};
    /** Звернення до фунції @func1 */
    func1(N);
    /** Звернення до фунції @func */
    func(N, mass);

    return 0;
}
