/**
* @mainpage
*# Загальне завдання
*1. **Завдання**
*	Реалізувати функцію, що визначає, скільки серед серед заданої *послідовності чисел таких пар, у котрих перше число менше наступного, *використовуючи функцію з варіативною кількістю аргументів.
*
*# Опис програми
*2. **Призачення**
*	Програма призначена для визначення кількості чисел таких пар, в *яких перше число менше настуупного
*3. **Логічна структура**
*	Програма складається з одної варіативної функції.
*@author Steghniy B.
*@date 05-dec-2020
*/

/**
* @file main.c
* Програма призначена для визначення кількості чисел таких пар, в яких перше число менше настуупного
*@author Steghniy B.
*@return 0
*@version 0.1 
*@date 05-dec-2020
*/

#include <stdarg.h>

/** Задаємо розмір масиву */
#define size 10
/** @func варіативна функція для визначення кількості чисел таких пар, у яких перше число менше наступного */
int func(int num, ...) {
  // Змінна для роботи зі списком чисел
  va_list numbers;
  // Початок роботи зі списком
  va_start(numbers, num);
  // Змінна позначення кількості чисел, які менше за наступне
  int count = 0;
  // Задаємо массив, який заповнений нулями
  int mass[size] = {};
  // Цикл для заповнення массиву
  for (int j = 0; j < num; j++) {
    mass[j] = va_arg(numbers, int);
  }
  // Цикл для перебору масиву та визначення результату (count)
  for (int i = 0; i < num; i++) {
    if(mass[i] < mass[i+1]){
      count++;
    }
  }
  // Завершення роботи зі списком
  va_end(numbers);
  return count;
}
/** Основна фунція @main */
int main() {
  /** Звернення до фунції @func */
  func(size, 1,2,3,4,5,6,7,8,9,10);

  return 0;
}
