int main()
{	// Додаємо змінну а та задаємо її значення
	int a = 102300;
	// Додаємо змінну а123 та задаємо її значеня(сумма перших трьох чисел)
	int a123 = 0;
	// Додаємо змінну а123 та задаємо її значеня(сумма останніх трьох чисел)
	int a456 = 0;

	// Додаємо оператор циклу for, змінну i, умову та приріст
	for(int i = 0; i < 3; i++){
	a456 = a456 + (a % 10); a = a / 10;
	}
	for(int i = 0; i < 3; i++){
	a123 = a123 + (a % 10); a = a / 10;
	}
	// Конструкція if..else для позначення результату
	if(a123 == a456){
	printf (" lucky ");
	}else{
	printf (" not lucky ");
	}
	
	
	
	int i = 0;
	// Додаємо оператор циклу while..do 
	while(i < 3){ // Умова
	a456 = a456 + (a % 10); a = a / 10;
	i++;
	}
	while(i < 6){
	a123 = a123 + (a % 10); a = a / 10;
	i++;	
	}
	// Конструкція if..else для позначення результату
	if(a123 == a456){
	printf (" lucky ");
	}else{
	printf (" not lucky ");
	}
	
	
	int i = 0;
	// Додаємо оператор циклу do..while
	do{
	a456 = a456 + (a % 10); a = a / 10;
	i++;
	}while(i < 3);
	
	do{
	a123 = a123 + (a % 10); a = a / 10;
	i++;
	}while(i < 6);
	// Конструкція if..else для позначення результату
	if(a123 == a456){
	printf (" lucky ");
	}else{
	printf (" not lucky ");
	}
	
	return 0;
}
