/**
* @mainpage
*# Загальне завдання
*1. **Завдання**
*	Дано двовимірний масив з N x N цілих чисел. Виконати ціклічне *зрушення елементів рядків масиву в напрямку справа наліво.
*
*# Опис програми
*2. **Призачення**
*	Програма призначена для циклічного зрушення елементів массиву
*3. **Логічна структура**
*	Програма складається з двох функцій. В одній виконується *заповнення матриці випадковими числами. В іншій виконується зрушення *елементів.
*@author Steghniy B.
*@date 05-dec-2020
*/

/**
* @file main.c
* Програма призначена для циклічного зрушення елементів массиву
*@author Steghniy B.
*@return 0
*@version 0.1 
*@date 05-dec-2020
*/

#include <stdlib.h>
#include <time.h>

/** Розмір матриці */
#define N 5
/** @zap Функція для заповнення масиву випадковими числами */
void zap(int mat[][N]){
	srand (time(NULL));
	for (int i = 0; i < N; i++){
	for (int j = 0; j < N; j++){
	mat[i][j] = rand() % 100;
	}
	}
}

/** @func Функція для циклічного зрушення елементів массиву */
int func(int mat[N][N]) {
    // Буферна змінна
    int tmp = 0; 
    // Цикл для перестановки елементів матриці та їх зсуву 
    for (int i = 0; i < N; i++) { 
        tmp = mat[i][0];
        for (int j = 0; j < N; j++) {
            mat[i][j] = mat[i][j + 1];
        }
        mat[i][N - 1] = tmp;

    }
    return 0;
}
/** Основна фунція @main */
int main()
{
    // Задаємо матрицю, розмір якої N * N
    
    int mat[N][N];
    /** Звернення до фунції @zap */
    zap(mat);
    /** Звернення до фунції @func */
    func(mat);

    return 0;
}
