/**
* @mainpage
*# Загальне завдання
*1. **Завдання**
*	Визначення найбільшого спільного дільника для двох чисел
*
*# Опис програми
*2. **Призачення**
*	Програма призначена для розрахунку найбільшого спільного дільника *серед двох чисел
*3. **Логічна структура**
*	Програма складається з однієї фунції, в якій проходять всі *операції розрахунку найбільного спільниго дільника
*@author Steghniy B.
*@date 05-dec-2020
*/

/**
* @file main.c
*	Програма призначена для розрахунку найбільшого спільного дільника *серед двох чисел
*@author Steghniy B.
*@return 0
*@version 0.1 
*@date 05-dec-2020
*/

/** @func1 Головна функція, в якій розраховується НОД */
int func1(int a, int b)
{
  int result = 0;


  /* Додаємо оператор циклу for, змінну nod, умову та приріст */
  for (int nod = a; nod > 0; nod--) {
  /* Якщо залишоки від ділення змінної а на змінну nod та ділення змінної b на змінну nod дорівнюють нулю, то результат дорівнює змінній nod */
    if (a % nod == 0 && b % nod == 0) {
      result = nod;
      break;
    }
  }


  int nod = a;
  /* Додаємо оператор циклу do..while */
  do {
  /* Якщо залишоки від ділення змінної а на змінну nod та ділення змінної b на змінну nod дорівнюють нулю, то результат дорівнює змінній nod */
    if (a % nod == 0 && b % nod == 0) {
      result = nod;
      break;
    }
    nod--;
    /* Умова циклу */
  } while (nod > 0);

  /* Додаємо оператор циклу while..do */
  while (nod > 0) // Умова
  {
   /* Якщо залишоки від ділення змінної а на змінну nod та ділення змінної b на   змінну nod дорівнюють нулю, то результат дорівнює змінній nod */
    if (a % nod == 0 && b % nod == 0) {
      result = nod;
      break;
    }
    nod--;
  }
  /** @return повертає значення НОД */
  return nod;
}
  /** Основна фунція @main */
  int main()
  {
    /** Звернення до фунції @func1 */
    func1( 1000, 500);
    
    return 0;
  }
