// Задаємо фунцію для перевірки
int func1(int N) {
    // Перевірка
    if (N <= 0) {
        exit(1);
    }
    return N;
}
// Задаємо функію для розрахунку простих чисел
int func(int N, int mass[]) {
    

    

    // Цикл для знаходження простих чисел с числа N

    for (int i = 2; i <= N; i++) {
        int count = 0; // Задаємо перемінну, яка буде визначати результат
        for (int j = 2; j < i; j++) {
            if (i % j == 0) {
                count = 1;
                break;
            }
        }
        // Якщо перемінна count дорівнює нуло, то число просте 
        if (count == 0) {
            // Вводимо просте число в массив
            mass[i] = i;

        }

    }
    return 0;
}

int main()
{
    // Задаємо константу перемінну N
#define N 13 
    // Задаємо массив mass
    int mass[N + 1] = {};
    // Виклик фунції для перевірки
    func1(N);
    // Виклик функції для обчислення простих чисел
    func(N, mass);

    return 0;
}
