int main() {
	// Змінна для визначення кількості слів
        int count = 0; 
	//Змінна, яка показує кількість символів в массиві
	int n = 0; // 
	//Задаємо массив символів в який вписуємо слова
        char mass[] = " sniggers "; 
	//Цикл while для знаходження
        while (mass[n] != '\0') {  
            n++;
        }
	//Цикл for для знаходження кількості слів в реченні
        for (int i = 0; i < n; i++) {
            if (mass[i] != ' ' && mass[i + 1] <= ' ') {
                count++;
            }
        }
	printf("%s", count); 
	
	return 0;
    }
