/**
* @mainpage
*# Загальне завдання
*1. **Завдання**
*	Центрувати рядок на площині з заданим заповнювачем
*
*# Опис програми
*2. **Призачення**
*	Програма призначена для центрування слова
*3. **Логічна структура**
*	Програма складається з однієї фунції, в якій проходять всі *операції для центрування рядку
*@author Steghniy B.
*@date 05-dec-2020
*/

/** 
* @file main.c
* Програма призначена для центрування слова 
*@author Steghniy B.
*@return 0
*@version 0.1 
*@date 05-dec-2020
*/

/** Кількість елементів у масиві */
#define N 12 

/** @func Головна функція, в якій центрується слово */
int func(char mass[], const int N) {
    // Кількість символів в імені
    int name = 0;
    int i = 0;
    while (mass[i] != '\0') {
        if (mass[i] != ' ') {
            name++;
        }
        i++;
    }

    // Задаємо заповнювач
    char zap = '_';
    // Визначаємо кількість пропусків в масиві
    int spaces = (N - 1) - name;
    // Якщо кількість символів в імені не парна, то програма закриваеться


    // Заповнення пробілів підкреслюваннями
    for (int i = 0; i < N; i++) {
        if (mass[i] == ' ') {
            mass[i] = zap;
        }
        // Зсув массиву 
    }
    for (int i = 0; i < spaces / 2; i++)

    {
        for (int j = N - 3; j >= 0; j--)
        {
            mass[j + 1] = mass[j];

        }
        // Вставка потрібних підкреслювать на початку масива
    }
    for (int i = 0; i < spaces / 2; i++)
    {
        mass[i] = zap;
    }
    printf("%s", mass);
    return 0;
}
/** Основна фунція @main */
int main()
{
   
    // Задаємо масив
    char mass[] = "abcdefg    ";
    /** Звернення до фунції @func */
    func(mass, N);

    return 0;
}
