/** 
* @mainpage
*# Загальне завдання
*1. **Завдання**
*	У заданому тексті знайти кількість слів за умови, що між словами *може буди будь-яка кількість пропусків.
*
*# Опис програми
*2. **Призачення**
*	Програма призначена знайдення кількості слів в рядку
*3. **Логічна структура**
*	Програма складається з однієї функції, в якій виконується *підрахунок кількості слів
*@author Steghniy B.
*@date 05-dec-2020
*/

/**
* @file main.c
* Програма призначена знайдення кількості слів в рядку
*@author Steghniy B.
*@return 0
*@version 0.1 
*@date 05-dec-2020
*/

/** @func Функція для визначення кількості слів */
int func(char mass[]) {
    // Змінна для визначення кількості слів
    int count = 0;
    //Змінна, яка показує кількість символів в массиві
    int n = 0;      //Цикл while для знаходження
    while (mass[n] != '\0') {
        n++;
    }
    //Цикл for для знаходження кількості слів в реченні
    for (int i = 0; i < n; i++) {
        if (mass[i] != ' ' && mass[i + 1] <= ' ') {
            count++;
        }
    }
    printf("%d", count);
    return count;
}
/** Основна фунція @main */
int main() {

    //Задаємо массив символів в який вписуємо слова
    char mass[] = " eight dollars  ";
    /** Звернення до фунції @func */
    func(mass);
	
    return 0;
    }
