int main()
{	// Вводимо змінну а та задаємо її значення
	int a = 3019;
	// Вводимо змінну count, яка буде відповідати за результат числа (просте аба не 		просте)
	int count = 0;
	
	// Додаємо оператор циклу for, змінну i, умову та приріст
	for(int i = 2; i < a; i++){
	// Якщо а ділиться на i без остатку, то додаємо до змінної count одиницю
	if( a % i == 0){
	count += 1;
	}
	}
	// Конструкція if..else для позначення результату
	if(count > 0 || a == 1){
	printf ("НЕ ПРОСТОЕ"); 
	}else{
	printf("ПРОСТОЕ");
	}
	
	
	
	int i = 2;
	// Додаємо оператор циклу while..do 
	while(i < a){ // Умова
	// Якщо а ділиться на i без остатку, то додаємо до змінної count одиницю
	if( a % i == 0){
	count += 1;
	}
	i++;
	}
	// Конструкція if..else для позначення результату
	if(count > 0 || a == 1){
	printf ("НЕ ПРОСТОЕ"); 
	}else{
	printf("ПРОСТОЕ");
	}
	
	
	
	/*int i = 2;*/
	// Додаємо оператор циклу do..while
	do{
	// Якщо а ділиться на i без остатку, то додаємо до змінної count одиницю
	if( a % i == 0){
	count += 1;
	}
	i++;
	// Умова
	}while(i < a);
	// Конструкція if..else для позначення результату
	if(count > 0 || a == 1){
	printf ("НЕ ПРОСТОЕ"); 
	}else{
	printf("ПРОСТОЕ");
	}
	
	return 0;
}
