int func1(int a, int b)
{
  int result = 0;


  // Додаємо оператор циклу for, змінну nod, умову та приріст
  for (int nod = a; nod > 0; nod--) {
    // Якщо залишоки від ділення змінної а на змінну nod та ділення змінної b на змінну nod дорівнюють нулю, то результат дорівнює змінній nod 
    if (a % nod == 0 && b % nod == 0) {
      result = nod;
      break;
    }
  }


  int nod = a;
  // Додаємо оператор циклу do..while
  do {
    // Якщо залишоки від ділення змінної а на змінну nod та ділення змінної b на змінну nod дорівнюють нулю, то результат дорівнює змінній nod 
    if (a % nod == 0 && b % nod == 0) {
      result = nod;
      break;
    }
    nod--;
    // Умова циклу
  } while (nod > 0);



  /* int nod = a */
  // Додаємо оператор циклу while..do 
  while (nod > 0) // Умова
  {
    // Якщо залишоки від ділення змінної а на змінну nod та ділення змінної b на   змінну nod дорівнюють нулю, то результат дорівнює змінній nod 
    if (a % nod == 0 && b % nod == 0) {
      result = nod;
      break;
    }
    nod--;
  }
  return nod;
}


  int main()
  {
    
    func1( 1000, 500);
    
    return 0;
  }
