int main()
{
	// Вводимо змінну а та задаємо її значення
	int a = 1;
	// Вводимо змінну b та задаємо її значення (сумма дільників числа а)
	int b = 0;
	
	
	// Додаємо оператор циклу for, змінну i, умову та приріст
	for(int i = 2; i <= a; i++){
	if(a % i == 0){
	b += (a / i);
	}
	}
	
	
	
	int i = 2;
	// Додаємо оператор циклу while..do 
	while (i <= a) { // Умова
	if(a % i == 0){
	b += (a / i);
	}
	i++;
	}
	
	
	int i = 2;
	// Додаємо оператор циклу do..while
	do {
	if(a % i == 0){
	b += (a / i);
	}
	{
	i++;
	}
	}
	while (i <= a); // Умова
	
	// Конструкція if..else для позначення результату
	if (a == 0 || a != b){
	printf(" Число не досконале ");
	}
	else if (a == b){
	printf(" Число досконале ");
	}
	
	
	return 0;
}

